itzandroidtab/klib-svd/lpc1754.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>UART1</name>
            <description>UART1 </description>
            <groupName>UART1</groupName>
            <baseAddress>0x40010000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>UART1</name>
                <value>6</value>
            </interrupt>
            <registers>
                <register>
                    <name>RBR</name>
                    <description>DLAB =0 Receiver Buffer Register. Contains the next received
                        character to be read.</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <readAction>modify</readAction>
                    <fields>
                        <field>
                            <name>RBR</name>
                            <description>The UART1 Receiver Buffer Register contains the oldest
                                received byte in the UART1 RX FIFO.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>THR</name>
                    <description>DLAB =0. Transmit Holding Register. The next character to be
                        transmitted is written here.</description>
                    <alternateRegister>RBR</alternateRegister>
                    <addressOffset>0x000</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>THR</name>
                            <description>Writing to the UART1 Transmit Holding Register causes the
                                data to be stored in the UART1 transmit FIFO. The byte will be sent
                                when it reaches the bottom of the FIFO and the transmitter is
                                available.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DLL</name>
                    <description>DLAB =1. Divisor Latch LSB. Least significant byte of the baud rate
                        divisor value. The full divisor is used to generate a baud rate from the
                        fractional rate divider.</description>
                    <alternateRegister>RBR</alternateRegister>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLLSB</name>
                            <description>The UART1 Divisor Latch LSB Register, along with the U1DLM
                                register, determines the baud rate of the UART1.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DLM</name>
                    <description>DLAB =1. Divisor Latch MSB. Most significant byte of the baud rate
                        divisor value. The full divisor is used to generate a baud rate from the
                        fractional rate divider.</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLMSB</name>
                            <description>The UART1 Divisor Latch MSB Register, along with the U1DLL
                                register, determines the baud rate of the UART1.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IER</name>
                    <description>DLAB =0. Interrupt Enable Register. Contains individual interrupt
                        enable bits for the 7 potential UART1 interrupts.</description>
                    <alternateRegister>DLM</alternateRegister>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RBRIE</name>
                            <description>RBR Interrupt Enable. Enables the Receive Data Available
                                interrupt for UART1. It also controls the Character Receive Time-out
                                interrupt.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_RDA_INTE</name>
                                    <description>Disable the RDA interrupts.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_RDA_INTER</name>
                                    <description>Enable the RDA interrupts.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>THREIE</name>
                            <description>THRE Interrupt Enable. Enables the THRE interrupt for
                                UART1. The status of this interrupt can be read from LSR[5].</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_THRE_INT</name>
                                    <description>Disable the THRE interrupts.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_THRE_INTE</name>
                                    <description>Enable the THRE interrupts.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXIE</name>
                            <description>RX Line Interrupt Enable. Enables the UART1 RX line status
                                interrupts. The status of this interrupt can be read from LSR[4:1].</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_RX_LINE_</name>
                                    <description>Disable the RX line status interrupts.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_RX_LINE_S</name>
                                    <description>Enable the RX line status interrupts.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MSIE</name>
                            <description>Modem Status Interrupt Enable. Enables the modem interrupt.
                                The status of this interrupt can be read from MSR[3:0].</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_MODEM_IN</name>
                                    <description>Disable the modem interrupt.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_MODEM_INT</name>
                                    <description>Enable the modem interrupt.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[6:4]</bitRange>
                        </field>
                        <field>
                            <name>CTSIE</name>
                            <description>CTS Interrupt Enable. If auto-cts mode is enabled this bit
                                enables/disables the modem status interrupt generation on a CTS1
                                signal transition. If auto-cts mode is disabled a CTS1 transition
                                will generate an interrupt if Modem Status Interrupt Enable (IER[3])
                                is set. In normal operation a CTS1 signal transition will generate a
                                Modem Status Interrupt unless the interrupt has been disabled by
                                clearing the IER[3] bit in the IER register. In auto-cts mode a
                                transition on the CTS1 bit will trigger an interrupt only if both
                                the IER[3] and IER[7] bits are set.</description>
                            <bitRange>[7:7]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_CTS_INTE</name>
                                    <description>Disable the CTS interrupt.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_CTS_INTER</name>
                                    <description>Enable the CTS interrupt.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABEOIE</name>
                            <description>Enables the end of auto-baud interrupt.</description>
                            <bitRange>[8:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_END_OF_AUTO_</name>
                                    <description>Disable end of auto-baud Interrupt.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_END_OF_AUTO_B</name>
                                    <description>Enable end of auto-baud Interrupt.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABTOIE</name>
                            <description>Enables the auto-baud time-out interrupt.</description>
                            <bitRange>[9:9]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_AUTO_BAUD_TI</name>
                                    <description>Disable auto-baud time-out Interrupt.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_AUTO_BAUD_TIM</name>
                                    <description>Enable auto-baud time-out Interrupt.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR</name>
                    <description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INTSTATUS</name>
                            <description>Interrupt status. Note that IIR[0] is active low. The
                                pending interrupt can be determined by evaluating IIR[3:1].</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>AT_LEAST_ONE_INTERRU</name>
                                    <description>At least one interrupt is pending.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_INTERRUPT_IS_PEND</name>
                                    <description>No interrupt is pending.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INTID</name>
                            <description>Interrupt identification. IER[3:1] identifies an interrupt
                                corresponding to the UART1 Rx or TX FIFO. All other combinations of
                                IER[3:1] not listed below are reserved (100,101,111).</description>
                            <bitRange>[3:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>RLS</name>
                                    <description>1 - Receive Line Status (RLS).</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RDA</name>
                                    <description>2a - Receive Data Available (RDA).</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTI</name>
                                    <description>2b - Character Time-out Indicator (CTI).</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THRE</name>
                                    <description>3 - THRE Interrupt.</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODEM</name>
                                    <description>4 - Modem Interrupt.</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[5:4]</bitRange>
                        </field>
                        <field>
                            <name>FIFOENABLE</name>
                            <description>Copies of FCR[0].</description>
                            <bitRange>[7:6]</bitRange>
                        </field>
                        <field>
                            <name>ABEOINT</name>
                            <description>End of auto-baud interrupt. True if auto-baud has finished
                                successfully and interrupt is enabled.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>ABTOINT</name>
                            <description>Auto-baud time-out interrupt. True if auto-baud has timed
                                out and interrupt is enabled.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
