itzandroidtab/klib-svd/lpc1754.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>GPIOINT</name>
            <description>GPIO</description>
            <groupName>GPIOINT</groupName>
            <!-- change this to base address 0x40028080 to be backwards compatible  WHY???? -->
            <baseAddress>0x40028080</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>STATUS</name>
                    <description>GPIO overall Interrupt Status.</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>P0INT</name>
                            <description>Port 0 GPIO interrupt pending.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_PENDING_INTERRUPT</name>
                                    <description>No pending interrupts on Port 0.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AT_LEAST_ONE_PENDING</name>
                                    <description>At least one pending interrupt on Port 0.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>P2INT</name>
                            <description>Port 2 GPIO interrupt pending.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_PENDING_INTERRUPT</name>
                                    <description>No pending interrupts on Port 2.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AT_LEAST_ONE_PENDING</name>
                                    <description>At least one pending interrupt on Port 2.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <cluster>
                    <dim>2</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>PORT[%s]</name>
                    <description>GPIO interrupt registers</description>
                    <headerStructName>int_port</headerStructName>
                    <addressOffset>0x4</addressOffset>
                    <access>read-write</access>
                    <register>
                        <name>STATR</name>
                        <description>GPIO Interrupt Status for Rising edge for Port 0.</description>
                        <addressOffset>0x000</addressOffset>
                        <access>read-only</access>
                        <resetValue>0</resetValue>
                        <resetMask>0xFFFFFFFF</resetMask>
                        <fields>
                            <field>
                                <name>P_0REI</name>
                                <description>Status of Rising Edge Interrupt for P[0]. 0 = No rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>P_1REI</name>
                                <description>Status of Rising Edge Interrupt for P[1]. 0 = No rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <field>
                                <name>P_2REI</name>
                                <description>Status of Rising Edge Interrupt for P[2]. 0 = No rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[2:2]</bitRange>
                            </field>
                            <field>
                                <name>P_3REI</name>
                                <description>Status of Rising Edge Interrupt for P[3]. 0 = No rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[3:3]</bitRange>
                            </field>
                            <field>
                                <name>P_4REI</name>
                                <description>Status of Rising Edge Interrupt for P[4]. 0 = No rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>P_5REI</name>
                                <description>Status of Rising Edge Interrupt for P[5]. 0 = No rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                            <field>
                                <name>P_6REI</name>
                                <description>Status of Rising Edge Interrupt for P[6]. 0 = No rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[6:6]</bitRange>
                            </field>
                            <field>
                                <name>P_7REI</name>
                                <description>Status of Rising Edge Interrupt for P[7]. 0 = No rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[7:7]</bitRange>
                            </field>
                            <field>
                                <name>P_8REI</name>
                                <description>Status of Rising Edge Interrupt for P[8]. 0 = No rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[8:8]</bitRange>
                            </field>
                            <field>
                                <name>P_9REI</name>
                                <description>Status of Rising Edge Interrupt for P[9]. 0 = No rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[9:9]</bitRange>
                            </field>
                            <field>
                                <name>P_10REI</name>
                                <description>Status of Rising Edge Interrupt for P[10]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[10:10]</bitRange>
                            </field>
                            <field>
                                <name>P_11REI</name>
                                <description>Status of Rising Edge Interrupt for P[11]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[11:11]</bitRange>
                            </field>
                            <field>
                                <name>P_12REI</name>
                                <description>Status of Rising Edge Interrupt for P[12]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[12:12]</bitRange>
                            </field>
                            <field>
                                <name>P_13REI</name>
                                <description>Status of Rising Edge Interrupt for P[13]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[13:13]</bitRange>
                            </field>
                            <field>
                                <name>P_14REI</name>
                                <description>Status of Rising Edge Interrupt for P[14]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[14:14]</bitRange>
                            </field>
                            <field>
                                <name>P_15REI</name>
                                <description>Status of Rising Edge Interrupt for P[15]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[15:15]</bitRange>
                            </field>
                            <field>
                                <name>P_16REI</name>
                                <description>Status of Rising Edge Interrupt for P[16]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[16:16]</bitRange>
                            </field>
                            <field>
                                <name>P_17REI</name>
                                <description>Status of Rising Edge Interrupt for P[17]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[17:17]</bitRange>
                            </field>
                            <field>
                                <name>P_18REI</name>
                                <description>Status of Rising Edge Interrupt for P[18]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[18:18]</bitRange>
                            </field>
                            <field>
                                <name>P_19REI</name>
                                <description>Status of Rising Edge Interrupt for P[19]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[19:19]</bitRange>
                            </field>
                            <field>
                                <name>P_20REI</name>
                                <description>Status of Rising Edge Interrupt for P[20]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[20:20]</bitRange>
                            </field>
                            <field>
                                <name>P_21REI</name>
                                <description>Status of Rising Edge Interrupt for P[21]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[21:21]</bitRange>
                            </field>
                            <field>
                                <name>P_22REI</name>
                                <description>Status of Rising Edge Interrupt for P[22]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[22:22]</bitRange>
                            </field>
                            <field>
                                <name>P_23REI</name>
                                <description>Status of Rising Edge Interrupt for P[23]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[23:23]</bitRange>
                            </field>
                            <field>
                                <name>P_24REI</name>
                                <description>Status of Rising Edge Interrupt for P[24]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[24:24]</bitRange>
                            </field>
                            <field>
                                <name>P_25REI</name>
                                <description>Status of Rising Edge Interrupt for P[25]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[25:25]</bitRange>
                            </field>
                            <field>
                                <name>P_26REI</name>
                                <description>Status of Rising Edge Interrupt for P[26]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[26:26]</bitRange>
                            </field>
                            <field>
                                <name>P_27REI</name>
                                <description>Status of Rising Edge Interrupt for P[27]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[27:27]</bitRange>
                            </field>
                            <field>
                                <name>P_28REI</name>
                                <description>Status of Rising Edge Interrupt for P[28]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[28:28]</bitRange>
                            </field>
                            <field>
                                <name>P_29REI</name>
                                <description>Status of Rising Edge Interrupt for P[29]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[29:29]</bitRange>
                            </field>
                            <field>
                                <name>P_30REI</name>
                                <description>Status of Rising Edge Interrupt for P[30]. 0 = No
                                    rising
                                    edge detected. 1 = Rising edge interrupt generated.</description>
                                <bitRange>[30:30]</bitRange>
                            </field>
                            <field>
                                <name>RESERVED</name>
                                <description>Reserved.</description>
                                <bitRange>[31:31]</bitRange>
                            </field>
                        </fields>
                    </register>
