itzandroidtab/klib-svd/lpc1754.svd
                <register>
                    <name>IMSC</name>
                    <description>Interrupt Mask Set and Clear Register</description>
                    <addressOffset>0x014</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RORIM</name>
                            <description>Software should set this bit to enable interrupt when a
                                Receive Overrun occurs, that is, when the Rx FIFO is full and
                                another frame is completely received. The ARM spec implies that the
                                preceding frame data is overwritten by the new frame data when this
                                occurs.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RTIM</name>
                            <description>Software should set this bit to enable interrupt when a
                                Receive Time-out condition occurs. A Receive Time-out occurs when
                                the Rx FIFO is not empty, and no has not been read for a time-out
                                period. The time-out period is the same for master and slave modes
                                and is determined by the SSP bit rate: 32 bits at PCLK / (CPSDVSR X
                                [SCR+1]).</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RXIM</name>
                            <description>Software should set this bit to enable interrupt when the
                                Rx FIFO is at least half full.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>TXIM</name>
                            <description>Software should set this bit to enable interrupt when the
                                Tx FIFO is at least half empty.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RIS</name>
                    <description>Raw Interrupt Status Register</description>
                    <addressOffset>0x018</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x00000008</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RORRIS</name>
                            <description>This bit is 1 if another frame was completely received
                                while the RxFIFO was full. The ARM spec implies that the preceding
                                frame data is overwritten by the new frame data when this occurs.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RTRIS</name>
                            <description>This bit is 1 if the Rx FIFO is not empty, and has not been
                                read for a time-out period. The time-out period is the same for
                                master and slave modes and is determined by the SSP bit rate: 32
                                bits at PCLK / (CPSDVSR X [SCR+1]).</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RXRIS</name>
                            <description>This bit is 1 if the Rx FIFO is at least half full.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>TXRIS</name>
                            <description>This bit is 1 if the Tx FIFO is at least half empty.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MIS</name>
                    <description>Masked Interrupt Status Register</description>
                    <addressOffset>0x01C</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RORMIS</name>
                            <description>This bit is 1 if another frame was completely received
                                while the RxFIFO was full, and this interrupt is enabled.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RTMIS</name>
                            <description>This bit is 1 if the Rx FIFO is not empty, has not been
                                read for a time-out period, and this interrupt is enabled. The
                                time-out period is the same for master and slave modes and is
                                determined by the SSP bit rate: 32 bits at PCLK / (CPSDVSR X
                                [SCR+1]).</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RXMIS</name>
                            <description>This bit is 1 if the Rx FIFO is at least half full, and
                                this interrupt is enabled.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>TXMIS</name>
                            <description>This bit is 1 if the Tx FIFO is at least half empty, and
                                this interrupt is enabled.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICR</name>
                    <description>SSPICR Interrupt Clear Register</description>
                    <addressOffset>0x020</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>RORIC</name>
                            <description>Writing a 1 to this bit clears the frame was received when
                                RxFIFO was full interrupt.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RTIC</name>
                            <description>Writing a 1 to this bit clears the Rx FIFO was not empty
                                and has not been read for a time-out period interrupt. The time-out
                                period is the same for master and slave modes and is determined by
                                the SSP bit rate: 32 bits at PCLK / (CPSDVSR / [SCR+1]).</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACR</name>
                    <description>SSP0 DMA control register</description>
                    <addressOffset>0x024</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXDMAE</name>
                            <description>Receive DMA Enable. When this bit is set to one 1, DMA for
                                the receive FIFO is enabled, otherwise receive DMA is disabled.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TXDMAE</name>
                            <description>Transmit DMA Enable. When this bit is set to one 1, DMA for
                                the transmit FIFO is enabled, otherwise transmit DMA is disabled</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:2]</bitRange>
                        </field>
                    </fields>
                </register>
