itzandroidtab/klib-svd/lpc1754.svd
                <register>
                    <name>TXRATE</name>
                    <description>I2S Transmit MCLK divider. This register determines the I2S TX MCLK
                        rate by specifying the value to divide PCLK by in order to produce MCLK.</description>
                    <addressOffset>0x020</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Y_DIVIDER</name>
                            <description>I2S transmit MCLK rate denominator. This value is used to
                                divide PCLK to produce the transmit MCLK. Eight bits of fractional
                                divide supports a wide range of possibilities. A value of 0 stops
                                the clock.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>X_DIVIDER</name>
                            <description>I2S transmit MCLK rate numerator. This value is used to
                                multiply PCLK by to produce the transmit MCLK. A value of 0 stops
                                the clock. Eight bits of fractional divide supports a wide range of
                                possibilities. Note: the resulting ratio X/Y is divided by 2.</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXRATE</name>
                    <description>I2S Receive MCLK divider. This register determines the I2S RX MCLK
                        rate by specifying the value to divide PCLK by in order to produce MCLK.</description>
                    <addressOffset>0x024</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Y_DIVIDER</name>
                            <description>I2S receive MCLK rate denominator. This value is used to
                                divide PCLK to produce the receive MCLK. Eight bits of fractional
                                divide supports a wide range of possibilities. A value of 0 stops
                                the clock.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>X_DIVIDER</name>
                            <description>I2S receive MCLK rate numerator. This value is used to
                                multiply PCLK by to produce the receive MCLK. A value of 0 stops the
                                clock. Eight bits of fractional divide supports a wide range of
                                possibilities. Note: the resulting ratio X/Y is divided by 2.</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXBITRATE</name>
                    <description>I2S Transmit bit rate divider. This register determines the I2S
                        transmit bit rate by specifying the value to divide TX_MCLK by in order to
                        produce the transmit bit clock.</description>
                    <addressOffset>0x028</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TX_BITRATE</name>
                            <description>I2S transmit bit rate. This value plus one is used to
                                divide TX_MCLK to produce the transmit bit clock.</description>
                            <bitRange>[5:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXBITRATE</name>
                    <description>I2S Receive bit rate divider. This register determines the I2S
                        receive bit rate by specifying the value to divide RX_MCLK by in order to
                        produce the receive bit clock.</description>
                    <addressOffset>0x02C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RX_BITRATE</name>
                            <description>I2S receive bit rate. This value plus one is used to divide
                                RX_MCLK to produce the receive bit clock.</description>
                            <bitRange>[5:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMODE</name>
                    <description>I2S Transmit mode control.</description>
                    <addressOffset>0x030</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TXCLKSEL</name>
                            <description>Clock source selection for the transmit bit clock divider.</description>
                            <bitRange>[1:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SELECT_THE_TX_FRACTI</name>
                                    <description>Select the TX fractional rate divider clock output
                                        as the source</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SELECT_THE_RX_MCLK_S</name>
                                    <description>Select the RX_MCLK signal as the TX_MCLK clock
                                        source</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TX4PIN</name>
                            <description>Transmit 4-pin mode selection. When 1, enables 4-pin mode.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>TXMCENA</name>
                            <description>Enable for the TX_MCLK output. When 0, output of TX_MCLK is
                                not enabled. When 1, output of TX_MCLK is enabled.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXMODE</name>
                    <description>I2S Receive mode control.</description>
                    <addressOffset>0x034</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXCLKSEL</name>
                            <description>Clock source selection for the receive bit clock divider.</description>
                            <bitRange>[1:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SELECT_THE_RX_FRACTI</name>
                                    <description>Select the RX fractional rate divider clock output
                                        as the source</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SELECT_THE_TX_MCLK_S</name>
                                    <description>Select the TX_MCLK signal as the RX_MCLK clock
                                        source</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RX4PIN</name>
                            <description>Receive 4-pin mode selection. When 1, enables 4-pin mode.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RXMCENA</name>
                            <description>Enable for the RX_MCLK output. When 0, output of RX_MCLK is
                                not enabled. When 1, output of RX_MCLK is enabled.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
