itzandroidtab/klib-svd/lpc1754.svd
                <register>
                    <name>INTEN_CLR</name>
                    <description>Interrupt Enable clear address</description>
                    <addressOffset>0x058</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>ILIM0_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>IMAT0_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>ICAP0_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>ILIM1_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>IMAT1_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>ICAP1_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>ILIM2_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>IMAT2_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>ICAP2_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[14:11]</bitRange>
                        </field>
                        <field>
                            <name>ABORT_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF</name>
                    <description>Interrupt flags read address</description>
                    <addressOffset>0x068</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ILIM0_F</name>
                            <description>Limit interrupt flag for channel 0.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THIS_INTERRUPT_SOURC</name>
                                    <description>This interrupt source is not contributing to the
                                        MCPWM interrupt request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IF_THE_CORRESPONDING</name>
                                    <description>If the corresponding bit in INTEN is 1, the MCPWM
                                        module is asserting its interrupt request to the Interrupt
                                        Controller.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IMAT0_F</name>
                            <description>Match interrupt flag for channel 0.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THIS_INTERRUPT_SOURC</name>
                                    <description>This interrupt source is not contributing to the
                                        MCPWM interrupt request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IF_THE_CORRESPONDING</name>
                                    <description>If the corresponding bit in INTEN is 1, the MCPWM
                                        module is asserting its interrupt request to the Interrupt
                                        Controller.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICAP0_F</name>
                            <description>Capture interrupt flag for channel 0.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THIS_INTERRUPT_SOURC</name>
                                    <description>This interrupt source is not contributing to the
                                        MCPWM interrupt request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IF_THE_CORRESPONDING</name>
                                    <description>If the corresponding bit in INTEN is 1, the MCPWM
                                        module is asserting its interrupt request to the Interrupt
                                        Controller.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>ILIM1_F</name>
                            <description>Limit interrupt flag for channel 1.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THIS_INTERRUPT_SOURC</name>
                                    <description>This interrupt source is not contributing to the
                                        MCPWM interrupt request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IF_THE_CORRESPONDING</name>
                                    <description>If the corresponding bit in INTEN is 1, the MCPWM
                                        module is asserting its interrupt request to the Interrupt
                                        Controller.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IMAT1_F</name>
                            <description>Match interrupt flag for channel 1.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THIS_INTERRUPT_SOURC</name>
                                    <description>This interrupt source is not contributing to the
                                        MCPWM interrupt request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IF_THE_CORRESPONDING</name>
                                    <description>If the corresponding bit in INTEN is 1, the MCPWM
                                        module is asserting its interrupt request to the Interrupt
                                        Controller.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICAP1_F</name>
                            <description>Capture interrupt flag for channel 1.</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THIS_INTERRUPT_SOURC</name>
                                    <description>This interrupt source is not contributing to the
                                        MCPWM interrupt request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IF_THE_CORRESPONDING</name>
                                    <description>If the corresponding bit in INTEN is 1, the MCPWM
                                        module is asserting its interrupt request to the Interrupt
                                        Controller.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>ILIM2_F</name>
                            <description>Limit interrupt flag for channel 2.</description>
                            <bitRange>[8:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THIS_INTERRUPT_SOURC</name>
                                    <description>This interrupt source is not contributing to the
                                        MCPWM interrupt request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IF_THE_CORRESPONDING</name>
                                    <description>If the corresponding bit in INTEN is 1, the MCPWM
                                        module is asserting its interrupt request to the Interrupt
                                        Controller.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IMAT2_F</name>
                            <description>Match interrupt flag for channel 2.</description>
                            <bitRange>[9:9]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THIS_INTERRUPT_SOURC</name>
                                    <description>This interrupt source is not contributing to the
                                        MCPWM interrupt request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IF_THE_CORRESPONDING</name>
                                    <description>If the corresponding bit in INTEN is 1, the MCPWM
                                        module is asserting its interrupt request to the Interrupt
                                        Controller.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICAP2_F</name>
                            <description>Capture interrupt flag for channel 2.</description>
                            <bitRange>[10:10]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THIS_INTERRUPT_SOURC</name>
                                    <description>This interrupt source is not contributing to the
                                        MCPWM interrupt request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IF_THE_CORRESPONDING</name>
                                    <description>If the corresponding bit in INTEN is 1, the MCPWM
                                        module is asserting its interrupt request to the Interrupt
                                        Controller.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[14:11]</bitRange>
                        </field>
                        <field>
                            <name>ABORT_F</name>
                            <description>Fast abort interrupt flag.</description>
                            <bitRange>[15:15]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THIS_INTERRUPT_SOURC</name>
                                    <description>This interrupt source is not contributing to the
                                        MCPWM interrupt request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IF_THE_CORRESPONDING</name>
                                    <description>If the corresponding bit in INTEN is 1, the MCPWM
                                        module is asserting its interrupt request to the Interrupt
                                        Controller.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
