itzandroidtab/klib-svd/lpc1754.svd
                <register>
                    <name>CNTCON_SET</name>
                    <description>Count Control set address</description>
                    <addressOffset>0x060</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>TC0MCI0_RE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TC0MCI0_FE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>TC0MCI1_RE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>TC0MCI1_FE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>TC0MCI2_RE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>TC0MCI2_FE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI0_RE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI0_FE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI1_RE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI1_FE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI2_RE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI2_FE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI0_RE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI0_FE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI1_RE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI1_FE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI2_RE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI2_FE_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[28:18]</bitRange>
                        </field>
                        <field>
                            <name>CNTR0_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>CNTR1_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>CNTR2_SET</name>
                            <description>Writing a one sets the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNTCON_CLR</name>
                    <description>Count Control clear address</description>
                    <addressOffset>0x064</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>TC0MCI0_RE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TC0MCI0_FE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>TC0MCI1_RE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>TC0MCI1_FE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>TC0MCI2_RE</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>TC0MCI2_FE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI0_RE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI0_FE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI1_RE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI1_FE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI2_RE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>TC1MCI2_FE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI0_RE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI0_FE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI1_RE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI1_FE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI2_RE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>TC2MCI2_FE_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[28:18]</bitRange>
                        </field>
                        <field>
                            <name>CNTR0_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>CNTR1_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>CNTR2_CLR</name>
                            <description>Writing a one clears the corresponding bit in the CNTCON
                                register.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAP_CLR</name>
                    <description>Capture clear address</description>
                    <addressOffset>0x074</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CAP_CLR0</name>
                            <description>Writing a 1 to this bit clears the CAP0 register.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>CAP_CLR1</name>
                            <description>Writing a 1 to this bit clears the CAP1 register.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>CAP_CLR2</name>
                            <description>Writing a 1 to this bit clears the CAP2 register.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved</description>
                            <bitRange>[31:3]</bitRange>
                        </field>
                    </fields>
                </register>
