itzandroidtab/klib-svd/lpc1754.svd
                <register>
                    <name>RSID</name>
                    <description>Reset Source Identification Register</description>
                    <addressOffset>0x180</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>POR</name>
                            <description>Assertion of the POR signal sets this bit, and clears all
                                of the other bits in this register. But if another Reset signal
                                (e.g., External Reset) remains asserted after the POR signal is
                                negated, then its bit is set. This bit is not affected by any of the
                                other sources of Reset.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EXTR</name>
                            <description>Assertion of the RESET signal sets this bit. This bit is
                                cleared only by software or POR.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>WDTR</name>
                            <description>This bit is set when the Watchdog Timer times out and the
                                WDTRESET bit in the Watchdog Mode Register is 1. This bit is cleared
                                only by software or POR.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>BODR</name>
                            <description>This bit is set when the VDD(REG)(3V3) voltage reaches a
                                level below the BOD reset trip level (typically 1.85 V under nominal
                                room temperature conditions). If the VDD(REG)(3V3) voltage dips from
                                the normal operating range to below the BOD reset trip level and
                                recovers, the BODR bit will be set to 1. If the VDD(REG)(3V3)
                                voltage dips from the normal operating range to below the BOD reset
                                trip level and continues to decline to the level at which POR is
                                asserted (nominally 1 V), the BODR bit is cleared. If the
                                VDD(REG)(3V3) voltage rises continuously from below 1 V to a level
                                above the BOD reset trip level, the BODR will be set to 1. This bit
                                is cleared only by software or POR. Note: Only in the case where a
                                reset occurs and the POR = 0, the BODR bit indicates if the
                                VDD(REG)(3V3) voltage was below the BOD reset trip level or not.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCS</name>
                    <description>System control and status</description>
                    <addressOffset>0x1A0</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. User software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>OSCRANGE</name>
                            <description>Main oscillator range select.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>Low. The frequency range of the main oscillator is
                                        1 MHz to 20 MHz.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>High. The frequency range of the main oscillator is
                                        15 MHz to 25 MHz.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OSCEN</name>
                            <description>Main oscillator enable.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <description>Disabled. The main oscillator is disabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <description>Enabled.The main oscillator is enabled, and will
                                        start up if the correct external circuitry is connected to
                                        the XTAL1 and XTAL2 pins.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OSCSTAT</name>
                            <description>Main oscillator status.</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NOT_READY</name>
                                    <description>Not ready. The main oscillator is not ready to be
                                        used as a clock source.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>READY</name>
                                    <description>Ready. The main oscillator is ready to be used as a
                                        clock source. The main oscillator must be enabled via the
                                        OSCEN bit.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. User software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:7]</bitRange>
                        </field>
                    </fields>
                </register>
