itzandroidtab/klib-svd/lpc1754.svd
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_6</name>
                                    <description>CCLK div 6. PCLK_peripheral = CCLK/6</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCLKSEL1</name>
                    <description>Peripheral Clock Selection register 1.</description>
                    <addressOffset>0x1AC</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PCLK_QEI</name>
                            <description>Peripheral clock selection for the Quadrature Encoder
                                Interface.</description>
                            <bitRange>[1:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCLK_GPIOINT</name>
                            <description>Peripheral clock selection for GPIO interrupts.</description>
                            <bitRange>[3:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCLK_PCB</name>
                            <description>Peripheral clock selection for the Pin Connect block.</description>
                            <bitRange>[5:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCLK_I2C1</name>
                            <description>Peripheral clock selection for I2C1.</description>
                            <bitRange>[7:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[9:8]</bitRange>
                        </field>
                        <field>
                            <name>PCLK_SSP0</name>
                            <description>Peripheral clock selection for SSP0.</description>
                            <bitRange>[11:10]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCLK_TIMER2</name>
                            <description>Peripheral clock selection for TIMER2.</description>
                            <bitRange>[13:12]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCLK_TIMER3</name>
                            <description>Peripheral clock selection for TIMER3.</description>
                            <bitRange>[15:14]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCLK_UART2</name>
                            <description>Peripheral clock selection for UART2.</description>
                            <bitRange>[17:16]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCLK_UART3</name>
                            <description>Peripheral clock selection for UART3.</description>
                            <bitRange>[19:18]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCLK_I2C2</name>
                            <description>Peripheral clock selection for I2C2.</description>
                            <bitRange>[21:20]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCLK_I2S</name>
                            <description>Peripheral clock selection for I2S.</description>
                            <bitRange>[23:22]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[25:24]</bitRange>
                        </field>
                        <field>
                            <name>PCLK_RIT</name>
                            <description>Peripheral clock selection for Repetitive Interrupt Timer.</description>
                            <bitRange>[27:26]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCLK_SYSCON</name>
                            <description>Peripheral clock selection for the System Control block.</description>
                            <bitRange>[29:28]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK</name>
                                    <description>CCLK. PCLK_peripheral = CCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_2</name>
                                    <description>CCLK div 2. PCLK_peripheral = CCLK/2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLK_DIV_8</name>
                                    <description>CCLK div 8. PCLK_peripheral = CCLK/8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCLK_MC</name>
                            <description>Peripheral clock selection for the Motor Control PWM.</description>
                            <bitRange>[31:30]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CCLK_DIV_4</name>
                                    <description>CCLK div 4. PCLK_peripheral = CCLK/4</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
