itzandroidtab/klib-svd/lpc1754.svd
                <register>
                    <name>INTERRCLR</name>
                    <description>DMA Interrupt Error Clear Register</description>
                    <addressOffset>0x010</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>INTERRCLR0</name>
                            <description>Writing a 1 clears the error interrupt request (IntErrStat)
                                for DMA channels. Each bit represents one channel: 0 - writing 0 has
                                no effect. 1 - clears the corresponding channel error interrupt.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>INTERRCLR1</name>
                            <description>Writing a 1 clears the error interrupt request (IntErrStat)
                                for DMA channels. Each bit represents one channel: 0 - writing 0 has
                                no effect. 1 - clears the corresponding channel error interrupt.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>INTERRCLR2</name>
                            <description>Writing a 1 clears the error interrupt request (IntErrStat)
                                for DMA channels. Each bit represents one channel: 0 - writing 0 has
                                no effect. 1 - clears the corresponding channel error interrupt.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>INTERRCLR3</name>
                            <description>Writing a 1 clears the error interrupt request (IntErrStat)
                                for DMA channels. Each bit represents one channel: 0 - writing 0 has
                                no effect. 1 - clears the corresponding channel error interrupt.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>INTERRCLR4</name>
                            <description>Writing a 1 clears the error interrupt request (IntErrStat)
                                for DMA channels. Each bit represents one channel: 0 - writing 0 has
                                no effect. 1 - clears the corresponding channel error interrupt.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>INTERRCLR5</name>
                            <description>Writing a 1 clears the error interrupt request (IntErrStat)
                                for DMA channels. Each bit represents one channel: 0 - writing 0 has
                                no effect. 1 - clears the corresponding channel error interrupt.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>INTERRCLR6</name>
                            <description>Writing a 1 clears the error interrupt request (IntErrStat)
                                for DMA channels. Each bit represents one channel: 0 - writing 0 has
                                no effect. 1 - clears the corresponding channel error interrupt.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>INTERRCLR7</name>
                            <description>Writing a 1 clears the error interrupt request (IntErrStat)
                                for DMA channels. Each bit represents one channel: 0 - writing 0 has
                                no effect. 1 - clears the corresponding channel error interrupt.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAWINTTCSTAT</name>
                    <description>DMA Raw Interrupt Terminal Count Status Register</description>
                    <addressOffset>0x014</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RAWINTTCSTAT0</name>
                            <description>Status of the terminal count interrupt for DMA channels
                                prior to masking. Each bit represents one channel: 0 - the
                                corresponding channel has no active terminal count interrupt
                                request. 1 - the corresponding channel does have an active terminal
                                count interrupt request.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTTCSTAT1</name>
                            <description>Status of the terminal count interrupt for DMA channels
                                prior to masking. Each bit represents one channel: 0 - the
                                corresponding channel has no active terminal count interrupt
                                request. 1 - the corresponding channel does have an active terminal
                                count interrupt request.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTTCSTAT2</name>
                            <description>Status of the terminal count interrupt for DMA channels
                                prior to masking. Each bit represents one channel: 0 - the
                                corresponding channel has no active terminal count interrupt
                                request. 1 - the corresponding channel does have an active terminal
                                count interrupt request.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTTCSTAT3</name>
                            <description>Status of the terminal count interrupt for DMA channels
                                prior to masking. Each bit represents one channel: 0 - the
                                corresponding channel has no active terminal count interrupt
                                request. 1 - the corresponding channel does have an active terminal
                                count interrupt request.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTTCSTAT4</name>
                            <description>Status of the terminal count interrupt for DMA channels
                                prior to masking. Each bit represents one channel: 0 - the
                                corresponding channel has no active terminal count interrupt
                                request. 1 - the corresponding channel does have an active terminal
                                count interrupt request.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTTCSTAT5</name>
                            <description>Status of the terminal count interrupt for DMA channels
                                prior to masking. Each bit represents one channel: 0 - the
                                corresponding channel has no active terminal count interrupt
                                request. 1 - the corresponding channel does have an active terminal
                                count interrupt request.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTTCSTAT6</name>
                            <description>Status of the terminal count interrupt for DMA channels
                                prior to masking. Each bit represents one channel: 0 - the
                                corresponding channel has no active terminal count interrupt
                                request. 1 - the corresponding channel does have an active terminal
                                count interrupt request.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTTCSTAT7</name>
                            <description>Status of the terminal count interrupt for DMA channels
                                prior to masking. Each bit represents one channel: 0 - the
                                corresponding channel has no active terminal count interrupt
                                request. 1 - the corresponding channel does have an active terminal
                                count interrupt request.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RAWINTERRSTAT</name>
                    <description>DMA Raw Error Interrupt Status Register</description>
                    <addressOffset>0x018</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RAWINTERRSTAT0</name>
                            <description>Status of the error interrupt for DMA channels prior to
                                masking. Each bit represents one channel: 0 - the corresponding
                                channel has no active error interrupt request. 1 - the corresponding
                                channel does have an active error interrupt request.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTERRSTAT1</name>
                            <description>Status of the error interrupt for DMA channels prior to
                                masking. Each bit represents one channel: 0 - the corresponding
                                channel has no active error interrupt request. 1 - the corresponding
                                channel does have an active error interrupt request.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTERRSTAT2</name>
                            <description>Status of the error interrupt for DMA channels prior to
                                masking. Each bit represents one channel: 0 - the corresponding
                                channel has no active error interrupt request. 1 - the corresponding
                                channel does have an active error interrupt request.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTERRSTAT3</name>
                            <description>Status of the error interrupt for DMA channels prior to
                                masking. Each bit represents one channel: 0 - the corresponding
                                channel has no active error interrupt request. 1 - the corresponding
                                channel does have an active error interrupt request.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTERRSTAT4</name>
                            <description>Status of the error interrupt for DMA channels prior to
                                masking. Each bit represents one channel: 0 - the corresponding
                                channel has no active error interrupt request. 1 - the corresponding
                                channel does have an active error interrupt request.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTERRSTAT5</name>
                            <description>Status of the error interrupt for DMA channels prior to
                                masking. Each bit represents one channel: 0 - the corresponding
                                channel has no active error interrupt request. 1 - the corresponding
                                channel does have an active error interrupt request.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTERRSTAT6</name>
                            <description>Status of the error interrupt for DMA channels prior to
                                masking. Each bit represents one channel: 0 - the corresponding
                                channel has no active error interrupt request. 1 - the corresponding
                                channel does have an active error interrupt request.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RAWINTERRSTAT7</name>
                            <description>Status of the error interrupt for DMA channels prior to
                                masking. Each bit represents one channel: 0 - the corresponding
                                channel has no active error interrupt request. 1 - the corresponding
                                channel does have an active error interrupt request.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ENBLDCHNS</name>
                    <description>DMA Enabled Channel Register</description>
                    <addressOffset>0x01C</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ENABLEDCHANNELS0</name>
                            <description>Enable status for DMA channels. Each bit represents one
                                channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>ENABLEDCHANNELS1</name>
                            <description>Enable status for DMA channels. Each bit represents one
                                channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>ENABLEDCHANNELS2</name>
                            <description>Enable status for DMA channels. Each bit represents one
                                channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>ENABLEDCHANNELS3</name>
                            <description>Enable status for DMA channels. Each bit represents one
                                channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>ENABLEDCHANNELS4</name>
                            <description>Enable status for DMA channels. Each bit represents one
                                channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>ENABLEDCHANNELS5</name>
                            <description>Enable status for DMA channels. Each bit represents one
                                channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>ENABLEDCHANNELS6</name>
                            <description>Enable status for DMA channels. Each bit represents one
                                channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>ENABLEDCHANNELS7</name>
                            <description>Enable status for DMA channels. Each bit represents one
                                channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
