itzandroidtab/klib-svd/lpc1754.svd
                <register>
                    <name>DEVINTEN</name>
                    <description>USB Device Interrupt Enable</description>
                    <addressOffset>0x204</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FRAMEEN</name>
                            <description>0 = No interrupt is generated. 1 = An interrupt will be
                                generated when the corresponding bit in the Device Interrupt Status
                                (USBDevIntSt) register (Table 261) is set. By default, the interrupt
                                is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
                                the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
                                interrupt line by changing the value of USBDevIntPri.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EP_FASTEN</name>
                            <description>0 = No interrupt is generated. 1 = An interrupt will be
                                generated when the corresponding bit in the Device Interrupt Status
                                (USBDevIntSt) register (Table 261) is set. By default, the interrupt
                                is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
                                the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
                                interrupt line by changing the value of USBDevIntPri.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EP_SLOWEN</name>
                            <description>0 = No interrupt is generated. 1 = An interrupt will be
                                generated when the corresponding bit in the Device Interrupt Status
                                (USBDevIntSt) register (Table 261) is set. By default, the interrupt
                                is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
                                the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
                                interrupt line by changing the value of USBDevIntPri.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>DEV_STATEN</name>
                            <description>0 = No interrupt is generated. 1 = An interrupt will be
                                generated when the corresponding bit in the Device Interrupt Status
                                (USBDevIntSt) register (Table 261) is set. By default, the interrupt
                                is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
                                the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
                                interrupt line by changing the value of USBDevIntPri.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>CCEMPTYEN</name>
                            <description>0 = No interrupt is generated. 1 = An interrupt will be
                                generated when the corresponding bit in the Device Interrupt Status
                                (USBDevIntSt) register (Table 261) is set. By default, the interrupt
                                is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
                                the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
                                interrupt line by changing the value of USBDevIntPri.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>CDFULLEN</name>
                            <description>0 = No interrupt is generated. 1 = An interrupt will be
                                generated when the corresponding bit in the Device Interrupt Status
                                (USBDevIntSt) register (Table 261) is set. By default, the interrupt
                                is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
                                the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
                                interrupt line by changing the value of USBDevIntPri.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RxENDPKTEN</name>
                            <description>0 = No interrupt is generated. 1 = An interrupt will be
                                generated when the corresponding bit in the Device Interrupt Status
                                (USBDevIntSt) register (Table 261) is set. By default, the interrupt
                                is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
                                the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
                                interrupt line by changing the value of USBDevIntPri.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>TxENDPKTEN</name>
                            <description>0 = No interrupt is generated. 1 = An interrupt will be
                                generated when the corresponding bit in the Device Interrupt Status
                                (USBDevIntSt) register (Table 261) is set. By default, the interrupt
                                is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
                                the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
                                interrupt line by changing the value of USBDevIntPri.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EP_RLZEDEN</name>
                            <description>0 = No interrupt is generated. 1 = An interrupt will be
                                generated when the corresponding bit in the Device Interrupt Status
                                (USBDevIntSt) register (Table 261) is set. By default, the interrupt
                                is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
                                the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
                                interrupt line by changing the value of USBDevIntPri.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>ERR_INTEN</name>
                            <description>0 = No interrupt is generated. 1 = An interrupt will be
                                generated when the corresponding bit in the Device Interrupt Status
                                (USBDevIntSt) register (Table 261) is set. By default, the interrupt
                                is routed to the USB_INT_REQ_LP interrupt line. Optionally, either
                                the EP_FAST or FRAME interrupt may be routed to the USB_INT_REQ_HP
                                interrupt line by changing the value of USBDevIntPri.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DEVINTCLR</name>
                    <description>USB Device Interrupt Clear</description>
                    <addressOffset>0x208</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FRAMECLR</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is cleared.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EP_FASTCLR</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is cleared.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EP_SLOWCLR</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is cleared.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>DEV_STATCLR</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is cleared.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>CCEMPTYCLR</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is cleared.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>CDFULLCLR</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is cleared.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RxENDPKTCLR</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is cleared.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>TxENDPKTCLR</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is cleared.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EP_RLZEDCLR</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is cleared.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>ERR_INTCLR</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is cleared.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DEVINTSET</name>
                    <description>USB Device Interrupt Set</description>
                    <addressOffset>0x20C</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FRAMESET</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is set.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EP_FASTSET</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is set.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EP_SLOWSET</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is set.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>DEV_STATSET</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is set.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>CCEMPTYSET</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is set.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>CDFULLSET</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is set.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RxENDPKTSET</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is set.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>TxENDPKTSET</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is set.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EP_RLZEDSET</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is set.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>ERR_INTSET</name>
                            <description>0 = No effect. 1 = The corresponding bit in USBDevIntSt
                                (Section 13.10.3.2) is set.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDCODE</name>
                    <description>USB Command Code</description>
                    <addressOffset>0x210</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>CMD_PHASE</name>
                            <description>The command phase:</description>
                            <bitRange>[15:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>READ</name>
                                    <description>Read</description>
                                    <value>0x02</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WRITE</name>
                                    <description>Write</description>
                                    <value>0x01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMMAND</name>
                                    <description>Command</description>
                                    <value>0x05</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMD_CODE_WDATA</name>
                            <description>This is a multi-purpose field. When CMD_PHASE is Command or
                                Read, this field contains the code for the command (CMD_CODE). When
                                CMD_PHASE is Write, this field contains the command write data
                                (CMD_WDATA).</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDDATA</name>
                    <description>USB Command Data</description>
                    <addressOffset>0x214</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMD_RDATA</name>
                            <description>Command Read Data.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXDATA</name>
                    <description>USB Receive Data</description>
                    <addressOffset>0x218</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RX_DATA</name>
                            <description>Data received.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXDATA</name>
                    <description>USB Transmit Data</description>
                    <addressOffset>0x21C</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TX_DATA</name>
                            <description>Transmit Data.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
