itzandroidtab/klib-svd/lpc1754.svd
                <register>
                    <name>DMARST</name>
                    <description>USB DMA Request Status</description>
                    <addressOffset>0x250</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EPRST0</name>
                            <description>Control endpoint OUT (DMA cannot be enabled for this
                                endpoint and EP0 bit must be 0).</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EPRST1</name>
                            <description>Control endpoint IN (DMA cannot be enabled for this
                                endpoint and EP1 bit must be 0).</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EPRST2</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>EPRST3</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>EPRST4</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>EPRST5</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>EPRST6</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>EPRST7</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EPRST8</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>EPRST9</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>EPRST10</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>EPRST11</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>EPRST12</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>EPRST13</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>EPRST14</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>EPRST15</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>EPRST16</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>EPRST17</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>EPRST18</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>EPRST19</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>EPRST20</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>EPRST21</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>EPRST22</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>EPRST23</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>EPRST24</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>EPRST25</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>EPRST26</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>EPRST27</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>EPRST28</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>EPRST29</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>EPRST30</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>EPRST31</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = DMA not
                                requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
