itzandroidtab/klib-svd/lpc1754.svd
                <register>
                    <name>DMARSET</name>
                    <description>USB DMA Request Set</description>
                    <addressOffset>0x258</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EPRSET0</name>
                            <description>Control endpoint OUT (DMA cannot be enabled for this
                                endpoint and the EP0 bit must be 0).</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET1</name>
                            <description>Control endpoint IN (DMA cannot be enabled for this
                                endpoint and the EP1 bit must be 0).</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET2</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET3</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET4</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET5</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET6</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET7</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET8</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET9</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET10</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET11</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET12</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET13</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET14</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET15</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET16</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET17</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET18</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET19</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET20</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET21</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET22</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET23</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET24</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET25</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET26</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET27</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET28</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET29</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET30</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>EPRSET31</name>
                            <description>Set the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 =
                                No effect 1 = Set the corresponding bit in USBDMARSt.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UDCAH</name>
                    <description>USB UDCA Head</description>
                    <addressOffset>0x280</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written. The UDCA is aligned to 128-byte boundaries.</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                        <field>
                            <name>UDCA_ADDR</name>
                            <description>Start address of the UDCA.</description>
                            <bitRange>[31:7]</bitRange>
                        </field>
                    </fields>
                </register>
